{"sections":{"main":{"type":"page-faqs","blocks":{"custom-content":{"type":"content","disabled":true,"settings":{"content":"<div class=\"mb-10\"><img src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0561\/2742\/2636\/files\/faqs.jpg?v=1620784288\"><\/div>\n<h3 class=\"font-medium text-xl mb-4\">Awkwardness gives me great comfort. I’ve never been cool, but I’ve felt cool. I’ve been in the cool place, but I wasn’t really cool – I was trying to pass for hip or cool.<\/h3>\n<p>A girl should be two things: classy and fabulous. I am convinced that there can be luxury in simplicity. I wanted to dress the woman who lives and works, not the woman in a painting. It’s hard to balance everything. It’s always challenging. My relationships with producers or photographers – these are relationships that took years. I can’t get sucked into that celebrity thing, because I think it’s just crass. My aim is to make the poor look rich.<\/p>"}},"accordion-1":{"type":"accordion","settings":{"title":"What ‘level’ of waterproof does your product provide? Can it be submersed?","content":"<p>Several rating systems exist, but there is not currently a US waterproof standard. Dry bag products are designed for nearly every weather condition and outdoor use, including boating, kayaking, camping, team sports, golf, pool, water parks and beach. Most of our products are designed to offer protection when you align the top edges, roll at least times, and click the buckle closed (to the side or together).<br\/><br\/>Several of our mobile device products have a zip-and-roll closed designed to handle quick submersions. They can be used for nearly any outdoor activity, but the cases are not intended for submersion and underwater activities. Our float phone case was developed to support more extreme water activities. It is ideal for activities like stand-up paddle boarding or kayaking since the case will float on top of the water with your device or other items inside.<\/p><p><\/p>","open":true}},"accordion-2":{"type":"accordion","settings":{"title":"Where can I find geckobrands products?","content":"<p>In addition to <a href=\"https:\/\/wixlabs-wix-faq-11.appspot.com\/#viewer-undefined\" target=\"_self\"><strong>www.geckobrands.com<\/strong><\/a><strong>,<\/strong> geckobrands products are currently sold at retailers through the US, Caribbean, Central America and South America. A few such retailers include Dick’s Sporting Goods, Academy Sports, Ron Jon Surf Shops, Surf Style, West Marine, Meijer, Carnival Cruise Lines, Royal Caribbean Cruise Lines, Ginnie Springs, Zion Outfitters, Amazon.com and hundreds of local retailers. Additional retailers continue to add geckobrands to their assortment, and we will continue to update our dealer page to reflect our valued partners.<\/p>","open":false}},"accordion-3":{"type":"accordion","settings":{"title":"How can I check whether an item is in stock?","content":"<p>Stock availability is shown in the product listing and details for each item.  Be sure to select a color or size if options are available in your desired product.<\/p>","open":false}},"accordion-4":{"type":"accordion","settings":{"title":"Do you offer custom logo options for your products?","content":"<p>We do offer the opportunity to add your logo or message to our innovative items. Please call us at 833-GOGECKO (464-3256) or email us at custom@geckobrands.com to speak to a sales representative to review options. Unfortunately, we are not able to customize all products and use any color due to the type of materials or construction of our unique items. Select items and larger quantity orders may require additional lead time and\/or deposits.<\/p>","open":false}},"accordion-5":{"type":"accordion","settings":{"title":"If my device or other item gets wet inside one of your products, will you replace it?","content":"<p>There are many ways for items to get wet and there is no way of knowing how anyone’s gear might have been damaged.  We cannot assume responsibility for wet devices or other items since people could request a replacement for all their old items to us.  The success of our products depend on proper closure and protection from sharp objects.  Be sure to inspect the dry bags before each use for punctures or tears.  When used as intended and closed properly, the products will provide the appropriate protection.<\/p>","open":false}}},"block_order":["custom-content","accordion-1","accordion-2","accordion-3","accordion-4","accordion-5"],"custom_css":[],"settings":{"container":"container","menu":""}},"145f534a-cf32-4b29-a447-5f5c5542339d":{"type":"home-values","disabled":true,"settings":{}},"footer_logo_PY9TBr":{"type":"footer-logo","settings":{}}},"order":["main","145f534a-cf32-4b29-a447-5f5c5542339d","footer_logo_PY9TBr"]}